const data = [
    {
        'name': 'Кино СССР',
        'interval': {
            'start': '1960',
            'end': '1977',
        },
        'slides': [
            {
                'name': '1960-1962: Ранние 60-е',
                'description': 'Начало десятилетия, закладываются основы жанров.',
            },
            {
                'name': '1963-1965: Комедии Гайдая',
                'description': 'Пик популярности фильмов Леонида Гайдая.',
            },
            {
                'name': '1966-1969: Новые имена',
                'description': 'Появление новых режиссёров и актеров.',
            },
            {
                'name': '1970-1973: Тарковский',
                'description': 'Фильмы Андрея Тарковского, влияние на мировое кино.',
            },
            {
                'name': '1974-1977: Конец эпохи',
                'description': 'Завершение периода расцвета советского кино.',
            },

        ]
    },
    {
        'name': 'Рок-музыка',
        'interval': {
            'start': '1960',
            'end': '1979',
        },
        'slides': [
            {
                'name': '1960-е: Ранний рок-н-ролл и Британское вторжение',
                'description': 'Ранний рок-н-ролл: Элвис Пресли, Чак Берри. Британское вторжение: The Beatles, The Rolling Stones.',
            },
            {
                'name': '1970-е: Прогрессивный рок',
                'description': 'Pink Floyd, Genesis, Yes.  Более сложные композиции и концептуальные альбомы.',
            },
            {
                'name': '1970-е: Хард-рок',
                'description': 'Led Zeppelin, Deep Purple, Black Sabbath.  Более тяжелое звучание и мощная энергетика.',
            },
            {
                'name': 'Середина 70-х: Панк-рок',
                'description': 'Ramones, Sex Pistols.  Протестное и бунтарское настроение.',
            },
            {
                'name': 'Конец 70-х: Новые волны',
                'description': 'The Police, Talking Heads.  Эксперименты со стилями и звучанием.',
            },
        ]
    },
    {
        'name': 'Космическая гонка',
        'interval': {
            'start': '1957',
            'end': '1975',
        },
        'slides': [
            {
                'name': '1957-1961: Первые успехи',
                'description': 'Первый спутник (СССР), полёт Гагарина (СССР).',
            },
            {
                'name': '1961-1965:  Развитие программ',
                'description': 'Развитие космических программ в СССР и США.',
            },
            {
                'name': '1966-1969:  Высадка на Луну',
                'description': 'Программа "Аполлон" (США), высадка человека на Луну.',
            },
            {
                'name': '1970-1972:  Новые проекты',
                'description': 'Новые космические станции и проекты.',
            },
            {
                'name': '1973-1975: Совместные миссии',
                'description': 'Начало сотрудничества между СССР и США в космосе.',
            },
        ]
    },
    {
        'name': 'Видеоигры',
        'interval': {
            'start': '1972',
            'end': '1989',
        },
        'slides': [
            {
                'name': '1972-1976:  Первые аркады',
                'description': 'Pong, Space Invaders.  Зарождение индустрии.',
            },
            {
                'name': '1977-1981:  Расцвет аркад',
                'description': 'Pac-Man, Donkey Kong, Space Invaders.',
            },
            {
                'name': '1982-1985:  8-битные консоли',
                'description': 'NES, Sega Master System.  Домашние игровые консоли.',
            },
            {
                'name': '1986-1989:  Новые жанры',
                'description': 'Появление новых жанров и игровых механик.',
            },
        ]
    },
    {
        'name': 'Персональные компьютеры',
        'interval': {
            'start': '1975',
            'end': '1990',
        },
        'slides': [
            {
                'name': '1975-1979: Первые ПК',
                'description': 'Altair 8800, Apple II.  Начало персональной эры.',
            },
            {
                'name': '1980-1984: IBM PC',
                'description': 'Распространение IBM PC и клонов.  Стандартизация.',
            },
            {
                'name': '1985-1989: Графический интерфейс',
                'description': 'Развитие графического интерфейса и операционных систем.',
            },
            {
                'name': '1990: Новые технологии',
                'description': 'Появление новых технологий и архитектур.',
            },
        ]
    },
    {
        'name': 'Мобильная связь',
        'interval': {
            'start': '1973',
            'end': '2000',
        },
        'slides': [
            {
                'name': '1970-е: Первые сети',
                'description': 'Развитие первых сотовых сетей.  Аналоговые системы.',
            },
            {
                'name': '1980-е: Распространение аналоговой связи',
                'description': 'Повсеместное внедрение аналоговых сотовых телефонов.',
            },
            {
                'name': '1990-е:  GSM',
                'description': 'Появление цифровых сетей GSM. Новые стандарты связи.',
            },
            {
                'name': 'Конец 90-х: Новые технологии',
                'description': 'Развитие новых технологий и протоколов.',
            },
        ]
    },
];